string_first = '=' * 30
string_two = '\n ||' + ' ' * 26 + '||'

# первый вариант
print(' ' + string_first + '\n Привет ' + '\n друг \n ' + string_first)

# второй вариант
print('\n ' + string_first + '\n ||' + ' ' * 8 + 'Привет' + ' ' * 12 + '||' +
      '\n ||' + ' ' * 9 + 'друг' + ' ' * 13 + '||' + '\n ' + string_first)

# третий вариант
print('\n ' + string_first + string_two * 2 + '\n ||' + ' ' * 10 + 'Привет,' +
      ' ' * 9 + '||' + '\n ||' + ' ' * 10 + 'друг!' + ' ' * 11 + '||' +
      string_two * 2 + '\n ' + string_first)

# четвёртый вариант
print('\n\u2554' + '\u2567' * 30 + '\u2557' + '\n\u2562 Привет' + ' ' * 23 +
      '\u255F' + '\n\u2562 друг' + ' ' * 25 + '\u255F' + '\n\u255A' +
      '\u2564' * 30 + '\u255D')
